docs/dev/done/research/test-quality-audit-2026-09-14/mutations/C-ghost-playback-008-01-phaseB.patch
diff --git a/Source/Parsek/GhostMapPresence.cs b/Source/Parsek/GhostMapPresence.cs
index e0d742cb5..e960edf0a 100644
--- a/Source/Parsek/GhostMapPresence.cs
+++ b/Source/Parsek/GhostMapPresence.cs
@@ -4059,6 +4059,7 @@ namespace Parsek
         {
             return !terminal.HasValue
                 || terminal.Value == TerminalState.Orbiting
+                || terminal.Value == TerminalState.SubOrbital
                 || terminal.Value == TerminalState.Docked;
         }
 
