docs/dev/done/research/test-quality-audit-2026-09-14/mutations/C-ledger-career-014-01-phaseB.patch
diff --git a/Source/Parsek/GameActions/ScienceModule.cs b/Source/Parsek/GameActions/ScienceModule.cs
index 5a25b3b1c..4ead42a82 100644
--- a/Source/Parsek/GameActions/ScienceModule.cs
+++ b/Source/Parsek/GameActions/ScienceModule.cs
@@ -413,7 +413,6 @@ namespace Parsek
             }
 
             runningScience += credit;
-            totalEffectiveEarnings += credit;
 
             ParsekLog.Verbose("ScienceModule",
                 $"StrategyScienceCredit: credit={credit.ToString("R", IC)}, " +
