docs/dev/done/research/test-quality-audit-2026-09-14/mutations/C-ledger-career-021-01-phaseB.patch
diff --git a/Source/Parsek/GameActions/FundsModule.cs b/Source/Parsek/GameActions/FundsModule.cs
index 47c8f839b..9800cea19 100644
--- a/Source/Parsek/GameActions/FundsModule.cs
+++ b/Source/Parsek/GameActions/FundsModule.cs
@@ -368,7 +368,7 @@ namespace Parsek
             }
 
             double amount = (double)action.MilestoneFundsAwarded;
-            if (amount <= 0.0)
+            if (amount == 0.0)
                 return;
 
             runningBalance += amount;
@@ -409,7 +409,7 @@ namespace Parsek
         private void ProcessContractAccept(GameAction action)
         {
             double advance = (double)action.AdvanceFunds;
-            if (advance <= 0.0)
+            if (advance == 0.0)
                 return;
 
             runningBalance += advance;
@@ -438,7 +438,7 @@ namespace Parsek
             }
 
             double reward = (double)action.TransformedFundsReward;
-            if (reward <= 0.0)
+            if (reward == 0.0)
                 return;
 
             runningBalance += reward;
@@ -461,7 +461,7 @@ namespace Parsek
         private void ProcessContractPenalty(GameAction action, string label)
         {
             double penalty = (double)action.FundsPenalty;
-            if (penalty <= 0.0)
+            if (penalty == 0.0)
                 return;
 
             runningBalance -= penalty;
@@ -514,7 +514,7 @@ namespace Parsek
         private void ProcessStrategySetupCost(GameAction action)
         {
             double cost = (double)action.SetupCost;
-            if (cost <= 0.0)
+            if (cost == 0.0)
                 return;
 
             bool affordable = runningBalance >= cost;
