docs/dev/done/research/test-quality-audit-2026-09-14/mutations/C-ledger-career-025-01-phaseB.patch
diff --git a/Source/Parsek/GameActions/KscActionExpectationClassifier.cs b/Source/Parsek/GameActions/KscActionExpectationClassifier.cs
index 406e1509f..8cea785c2 100644
--- a/Source/Parsek/GameActions/KscActionExpectationClassifier.cs
+++ b/Source/Parsek/GameActions/KscActionExpectationClassifier.cs
@@ -269,18 +269,8 @@ namespace Parsek
                         SkipReason = "direct earning -- post-walk hook reconciles (#440)"
                     };
 
-                case GameActionType.StrategyScienceCredit:
-                    // The query-family OUTPUT leg. There is no paired event AT ALL for
-                    // this family (the converter mutates a CurrencyModifierQuery in
-                    // place and the resulting ScienceChanged carries the ORIGINAL
-                    // reason), so an Untransformed leg would WARN on every single row.
-                    return new KscActionExpectation
-                    {
-                        Class = KscReconcileClass.Transformed,
-                        SkipReason = "strategy currency-converter science yield -- no " +
-                                     "reason-keyed event exists for the query family"
-                    };
-
+                // MUTANT: the StrategyScienceCredit arm is gone; the row now falls to
+                // the generic earning default below.
                 case GameActionType.StrategyScienceDebit:
                     // The science INPUT leg of a strategy currency exchange, captured
                     // DIRECTLY from the very ScienceChanged(StrategyInput) event a
