docs/dev/done/research/test-quality-audit-2026-09-14/mutations/C-recorder-events-015-02-phaseB.patch
diff --git a/Source/Parsek/WatchModeController.cs b/Source/Parsek/WatchModeController.cs
index be392683b..d847085c5 100644
--- a/Source/Parsek/WatchModeController.cs
+++ b/Source/Parsek/WatchModeController.cs
@@ -3592,7 +3592,7 @@ namespace Parsek
                 scheduleStartUT,
                 playbackStartUT,
                 duration,
-                effectiveCadence, loopCycleIndex);
+                userPeriodSeconds, loopCycleIndex);
         }
 
         private bool TryEnsurePrimaryWatchGhostLoaded(
