docs/dev/done/research/test-quality-audit-2026-09-14/mutations/C-recording-tree-050-01-phaseB.patch
diff --git a/Source/Parsek/RecordingTreeRecordCodec.cs b/Source/Parsek/RecordingTreeRecordCodec.cs
index d248a92b8..8c84090f7 100644
--- a/Source/Parsek/RecordingTreeRecordCodec.cs
+++ b/Source/Parsek/RecordingTreeRecordCodec.cs
@@ -812,7 +812,7 @@ namespace Parsek
                     $"LoadRecordingResourceAndState: loaded {rec.Controllers.Count} controller(s) for recording={rec.RecordingId}");
             }
 
-            rec.IsDebris = ParseBoolOr(recNode, "isDebris", rec.IsDebris);
+            rec.IsDebris = ParseBoolOr(recNode, "isDebris", true);
 
             // Parent-anchor recording id (sparse on disk). Missing key on recordings
             // with no parent anchor, which default to null. The legacy-debris playback
