docs/dev/done/research/test-quality-audit-2026-09-14/mutations/C-rewind-refly-003-01-phaseB.patch
diff --git a/Source/Parsek/SupersedeCommit.cs b/Source/Parsek/SupersedeCommit.cs
index 00b958c1d..9b5c34195 100644
--- a/Source/Parsek/SupersedeCommit.cs
+++ b/Source/Parsek/SupersedeCommit.cs
@@ -648,7 +648,6 @@ namespace Parsek
                 if (tip != null
                     && !string.IsNullOrEmpty(tip.ChainId)
                     && string.Equals(rec.ChainId, tip.ChainId, StringComparison.Ordinal)
-                    && rec.ChainBranch == tip.ChainBranch
                     && rec.ChainIndex < tip.ChainIndex)
                 {
                     reason = PreRewindCarveOutReason.PreRewindChainHead;
