docs/dev/done/research/test-quality-audit-2026-09-14/mutations/C-rewind-refly-011-01-phaseB.patch
diff --git a/Source/Parsek/RewindPointReaper.cs b/Source/Parsek/RewindPointReaper.cs
index e0933e3c1..59ec6876b 100644
--- a/Source/Parsek/RewindPointReaper.cs
+++ b/Source/Parsek/RewindPointReaper.cs
@@ -283,7 +283,6 @@ namespace Parsek
             {
                 if (File.Exists(absolute))
                 {
-                    File.Delete(absolute);
                     ParsekLog.Verbose(Tag,
                         $"Deleted rewind quicksave rp={rp.RewindPointId} path={absolute}");
                 }
