docs/dev/done/research/test-quality-audit-2026-09-14/mutations/C-rewind-refly-016-01-phaseB.patch
diff --git a/Source/Parsek/GameActions/TombstoneEligibility.cs b/Source/Parsek/GameActions/TombstoneEligibility.cs
index f7bcefd0e..75eb4cfc1 100644
--- a/Source/Parsek/GameActions/TombstoneEligibility.cs
+++ b/Source/Parsek/GameActions/TombstoneEligibility.cs
@@ -192,12 +192,6 @@ namespace Parsek
                     return true;
                 }
 
-                double delta = Math.Abs(other.UT - candidate.UT);
-                if (delta <= BundledRepUtWindow)
-                {
-                    pairedDeathAction = other;
-                    return true;
-                }
             }
             return false;
         }
