docs/dev/done/research/test-quality-audit-2026-09-14/mutations/C-rewind-refly-016-02-phaseB.patch
diff --git a/Source/Parsek/GameActions/TombstoneEligibility.cs b/Source/Parsek/GameActions/TombstoneEligibility.cs
index f7bcefd0e..21e1370a3 100644
--- a/Source/Parsek/GameActions/TombstoneEligibility.cs
+++ b/Source/Parsek/GameActions/TombstoneEligibility.cs
@@ -75,7 +75,6 @@ namespace Parsek
                 // KSC-path row (recordingId null) is untouched - this governs only a
                 // flight-tagged capture.
                 case GameActionType.StrategyScienceDebit:
-                case GameActionType.StrategyScienceCredit:
                 case GameActionType.FundsEarning:
                 case GameActionType.MilestoneAchievement:
                 case GameActionType.ContractAccept:
