docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-ghost-playback-015-01-phaseB.patch
diff --git a/Source/Parsek/GhostPartEventApplyLog.cs b/Source/Parsek/GhostPartEventApplyLog.cs
index 668c51747..f5854844f 100644
--- a/Source/Parsek/GhostPartEventApplyLog.cs
+++ b/Source/Parsek/GhostPartEventApplyLog.cs
@@ -210,7 +210,6 @@ namespace Parsek
             GhostPartEventOutcome reason)
         {
             return string.Format(
-                CultureInfo.InvariantCulture,
                 "apply family={0} surface={1} rec={2} pid={3} applied={4} skipped={5} reason={6}",
                 family,
                 SurfaceToken(surface),
