docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-ghost-playback-017-02-phaseB.patch
diff --git a/Source/Parsek/GhostExtender.cs b/Source/Parsek/GhostExtender.cs
index 661fc25dc..6b1713682 100644
--- a/Source/Parsek/GhostExtender.cs
+++ b/Source/Parsek/GhostExtender.cs
@@ -53,7 +53,7 @@ namespace Parsek
             {
                 ParsekLog.Verbose(Tag,
                     string.Format(ic,
-                        "ChooseStrategy: Orbital (body={0} sma={1:F0} ecc={2:F4})",
+                        "ChooseStrategy: Orbital (sma={1:F0} ecc={2:F4})",
                         rec.TerminalOrbitBody, rec.TerminalOrbitSemiMajorAxis, rec.TerminalOrbitEccentricity));
                 return GhostExtensionStrategy.Orbital;
             }
