docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-ledger-career-004-02-phaseB.patch
diff --git a/Source/Parsek/GameActions/KspStatePatcher.cs b/Source/Parsek/GameActions/KspStatePatcher.cs
index 8d15fb3f3..e0e887384 100644
--- a/Source/Parsek/GameActions/KspStatePatcher.cs
+++ b/Source/Parsek/GameActions/KspStatePatcher.cs
@@ -1192,9 +1192,7 @@ namespace Parsek
         internal static double ComputePendingAdjustedRunningScience(
             double preStrategyRunning, double currentLiveScience)
         {
-            return preStrategyRunning
-                - LedgerOrchestrator.GetPendingUncommittedStrategyScienceDebit(
-                    preStrategyRunning, currentLiveScience);
+            return preStrategyRunning;
         }
 
         /// <summary>
