docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-ledger-career-017-01-phaseB.patch
diff --git a/Source/Parsek/GameActions/ReputationModule.cs b/Source/Parsek/GameActions/ReputationModule.cs
index d09b102b5..1b59e882e 100644
--- a/Source/Parsek/GameActions/ReputationModule.cs
+++ b/Source/Parsek/GameActions/ReputationModule.cs
@@ -105,6 +105,7 @@ namespace Parsek
                     break;
 
                 case GameActionType.ReputationInitial:
+                case GameActionType.FundsInitial:
                     ProcessReputationInitial(action);
                     break;
 
