docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-logistics-route-034-03-phaseB.patch
diff --git a/Source/Parsek/ParsekScenario.cs b/Source/Parsek/ParsekScenario.cs
index 91263671c..6c281bd5a 100644
--- a/Source/Parsek/ParsekScenario.cs
+++ b/Source/Parsek/ParsekScenario.cs
@@ -1001,7 +1001,7 @@ namespace Parsek
 
             try
             {
-                RouteOrchestrator.Tick(currentUT);
+                // RouteOrchestrator.Tick(currentUT);
             }
             catch (Exception ex)
             {
