docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-map-render-009-03-phaseB.patch
diff --git a/Source/Parsek/PannotationsSidecarBinary.cs b/Source/Parsek/PannotationsSidecarBinary.cs
index d90aba48c..5f021a7a1 100644
--- a/Source/Parsek/PannotationsSidecarBinary.cs
+++ b/Source/Parsek/PannotationsSidecarBinary.cs
@@ -218,7 +218,7 @@ namespace Parsek
 
                 probe.Success = true;
                 probe.BinaryVersion = binaryVersion;
-                probe.AlgorithmStampVersion = algorithmStampVersion;
+                probe.AlgorithmStampVersion = AlgorithmStampVersion;
                 probe.SourceSidecarEpoch = sourceSidecarEpoch;
                 probe.SourceRecordingFormatVersion = sourceRecordingFormatVersion;
                 probe.ConfigurationHash = configurationHash;
