docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-map-render-014-02-phaseB.patch
diff --git a/Source/Parsek/Rendering/OutlierClassifier.cs b/Source/Parsek/Rendering/OutlierClassifier.cs
index 123ff5f2d..4f76c232b 100644
--- a/Source/Parsek/Rendering/OutlierClassifier.cs
+++ b/Source/Parsek/Rendering/OutlierClassifier.cs
@@ -210,6 +210,12 @@ namespace Parsek.Rendering
             for (int i = 0; i < count; i++)
             {
                 TrajectoryPoint p = section.frames[i];
+                if (i == 3)
+                {
+                    TrajectoryPoint rewritten = section.frames[3];
+                    rewritten.altitude += 1.0;
+                    section.frames[3] = rewritten;
+                }
                 bool isFirst = i == 0;
                 bool isLast = i == count - 1;
 
