docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-map-render-015-02-control-greenpatch.patch
diff --git a/Source/Parsek/MapRender/ShadowRenderDriver.cs b/Source/Parsek/MapRender/ShadowRenderDriver.cs
index c40ada530..643f1ee96 100644
--- a/Source/Parsek/MapRender/ShadowRenderDriver.cs
+++ b/Source/Parsek/MapRender/ShadowRenderDriver.cs
@@ -320,7 +320,7 @@ namespace Parsek.MapRender
                     string.Format(CultureInfo.InvariantCulture,
                         "spine deferred: live clock not ready (liveUT={0:R} <= 0 / non-finite); rendering nothing this frame",
                         currentUT),
-                    5.0);
+                    10.0);
                 // PruneStaleState is intentionally NOT called: a transient UT=0 frame must not drop the
                 // cached chains / prior intents the next ready frame resumes from. The defer is a hold.
                 return;
