docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-map-render-023-01-phaseB.patch
diff --git a/Source/Parsek/ParsekFlight.cs b/Source/Parsek/ParsekFlight.cs
index 9435ae44c..976eeaf1a 100644
--- a/Source/Parsek/ParsekFlight.cs
+++ b/Source/Parsek/ParsekFlight.cs
@@ -22196,15 +22196,15 @@ namespace Parsek
             bool allowNormalPlaybackHermite,
             out string reason)
         {
-            if (splineApplied)
+            if (suppressHermite)
             {
-                reason = "spline-applied";
+                reason = "suppressed";
                 return false;
             }
 
-            if (suppressHermite)
+            if (splineApplied)
             {
-                reason = "suppressed";
+                reason = "spline-applied";
                 return false;
             }
 
