docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-map-render-027-01-phaseB.patch
diff --git a/Source/Parsek/TrajectorySidecarBinary.cs b/Source/Parsek/TrajectorySidecarBinary.cs
index 61c19dd2c..f1184a37b 100644
--- a/Source/Parsek/TrajectorySidecarBinary.cs
+++ b/Source/Parsek/TrajectorySidecarBinary.cs
@@ -1083,7 +1083,7 @@ namespace Parsek
                 }
 
                 pt.recordedGroundClearance = reader.ReadDouble();
-                pt.flags = reader.ReadByte();
+                pt.flags = (byte)(reader.ReadByte() & (byte)TrajectoryPointFlags.StructuralEventSnapshot);
 
                 points.Add(pt);
             }
