docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-mission-groups-014-01-phaseB.patch
diff --git a/Source/Parsek/UI/RecordingsTableUI.cs b/Source/Parsek/UI/RecordingsTableUI.cs
index 058f7c276..a69b4559d 100644
--- a/Source/Parsek/UI/RecordingsTableUI.cs
+++ b/Source/Parsek/UI/RecordingsTableUI.cs
@@ -6376,7 +6376,7 @@ namespace Parsek
 
             for (int row = 0; row < sortedIndices.Length; row++)
             {
-                int ri = sortedIndices[row];
+                int ri = row; // MUTANT: sortedIndices remap dropped
                 var rec = committed[ri];
                 if (IsInactiveForDisplay(rec, supersedes, retirements))
                     continue;
