docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-recorder-events-023-04-phaseB.patch
diff --git a/Source/Parsek/ParsekFlight.TerminalEvents.cs b/Source/Parsek/ParsekFlight.TerminalEvents.cs
index 57d61688d..5c2bc0225 100644
--- a/Source/Parsek/ParsekFlight.TerminalEvents.cs
+++ b/Source/Parsek/ParsekFlight.TerminalEvents.cs
@@ -323,7 +323,6 @@ namespace Parsek
             // would leave a destroyed resume looking like a boring no-op coast and
             // get auto-discarded. Set unconditionally (even when the terminal is
             // already Destroyed) so the bool can never drift from the terminal.
-            rec.VesselDestroyed = true;
 
             if (rec.TerminalStateValue == TerminalState.Destroyed) return false;
 
