docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-recorder-events-024-05-phaseB.patch
diff --git a/Source/Parsek/BackgroundRecorder.cs b/Source/Parsek/BackgroundRecorder.cs
index 38dd093ac..ac7413a88 100644
--- a/Source/Parsek/BackgroundRecorder.cs
+++ b/Source/Parsek/BackgroundRecorder.cs
@@ -339,7 +339,7 @@ namespace Parsek
             if (p?.vessel == null)
             {
                 ParsekLog.VerboseRateLimited("BgRecorder", "bg-part-die-null",
-                    "OnBackgroundPartDie: part or vessel is null");
+                    "part or vessel is null");
                 return;
             }
 
