docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-002-02-phaseB.patch
diff --git a/Source/Parsek/RecordingOptimizer.cs b/Source/Parsek/RecordingOptimizer.cs
index 3bec5cc89..f5349d34b 100644
--- a/Source/Parsek/RecordingOptimizer.cs
+++ b/Source/Parsek/RecordingOptimizer.cs
@@ -627,6 +627,8 @@ namespace Parsek
                         normalizedOrdinalShifts++;
                 }
                 if (rec.TrackSections == null || rec.TrackSections.Count < 2) continue;
+                // MUTATION: tree recordings skipped by the split scan.
+                if (!string.IsNullOrEmpty(rec.TreeId)) continue;
 
                 // Per-recording aggregate counters (CLAUDE.md "Batch counting convention" —
                 // an eccentric grazing recording can present hundreds of suppressed boundaries,
