docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-011-01-phaseB.patch
diff --git a/Source/Parsek/ParsekScenario.cs b/Source/Parsek/ParsekScenario.cs
index 56b237769..d2479fce0 100644
--- a/Source/Parsek/ParsekScenario.cs
+++ b/Source/Parsek/ParsekScenario.cs
@@ -732,7 +732,7 @@ namespace Parsek
         /// </summary>
         internal static bool ComputeIsRevertOnLoad(bool isVesselSwitch, RevertKind revertKind)
         {
-            return !isVesselSwitch && revertKind != RevertKind.None;
+            return revertKind != RevertKind.None;
         }
 
         /// <summary>
warning: in the working copy of 'Source/Parsek/ParsekScenario.cs', LF will be replaced by CRLF the next time Git touches it
