docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-013-04-phaseB.patch
diff --git a/Source/Parsek/TrajectorySidecarBinary.cs b/Source/Parsek/TrajectorySidecarBinary.cs
index 61c19dd2c..d1ae27034 100644
--- a/Source/Parsek/TrajectorySidecarBinary.cs
+++ b/Source/Parsek/TrajectorySidecarBinary.cs
@@ -1001,6 +1001,8 @@ namespace Parsek
             stats.SparsePointLists++;
             stats.SparsePoints += count;
 
+            try
+            {
             for (int i = 0; i < count; i++)
             {
                 var pt = new TrajectoryPoint
@@ -1087,6 +1089,8 @@ namespace Parsek
 
                 points.Add(pt);
             }
+            }
+            catch (EndOfStreamException) { points.Clear(); throw; }
         }
 
         private static SparsePointListPlan BuildSparsePointListPlan(List<TrajectoryPoint> points)
