docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-021-01-phaseB.patch
diff --git a/Source/Parsek/CrewReservationManager.cs b/Source/Parsek/CrewReservationManager.cs
index ebdbb2f1b..c7b7890f6 100644
--- a/Source/Parsek/CrewReservationManager.cs
+++ b/Source/Parsek/CrewReservationManager.cs
@@ -740,6 +740,7 @@ namespace Parsek
 
             // Always remove the mapping
             crewReplacements.Remove(originalName);
+            ClearRescuePlaced(originalName);
             return true;
         }
 
