docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-030-06-phaseB.patch
diff --git a/Source/Parsek/RecordingStore.cs b/Source/Parsek/RecordingStore.cs
index bb9af7e10..cf87d21db 100644
--- a/Source/Parsek/RecordingStore.cs
+++ b/Source/Parsek/RecordingStore.cs
@@ -3754,7 +3754,7 @@ namespace Parsek
         /// </summary>
         internal static double GetChainEndUT(Recording rec)
         {
-            if (string.IsNullOrEmpty(rec.ChainId) || rec.ChainIndex < 0) return rec.EndUT;
+            // MUTATION: chain guard deleted
             double maxEnd = rec.EndUT;
             for (int i = 0; i < committedRecordings.Count; i++)
             {
