docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-030-09-phaseB.patch
diff --git a/Source/Parsek/RecordingStore.cs b/Source/Parsek/RecordingStore.cs
index bb9af7e10..61125d0f2 100644
--- a/Source/Parsek/RecordingStore.cs
+++ b/Source/Parsek/RecordingStore.cs
@@ -887,6 +887,7 @@ namespace Parsek
                 DeleteRecordingFiles(committedRecordings[i]);
             committedRecordings.Clear();
             committedTrees.Clear();
+            pendingTree = null; // MUTATION: also wipe the stashed pending tree
             ClearCommittedTreeRestoreAttempt("ClearCommitted");
             ClearRewindReplayTargetScope();
             BumpStateVersion();
