docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-036-01-phaseB.patch
diff --git a/Source/Parsek/TreeDiscardPurge.cs b/Source/Parsek/TreeDiscardPurge.cs
index 358b7720f..309cb4d7b 100644
--- a/Source/Parsek/TreeDiscardPurge.cs
+++ b/Source/Parsek/TreeDiscardPurge.cs
@@ -170,7 +170,6 @@ namespace Parsek
             // changes).
             if (tombstonesPurged > 0)
             {
-                CrewReservationManager.RecomputeAfterTombstones();
                 ParsekLog.Info(CrewTag,
                     $"PurgeTree: recomputed reservations after {tombstonesPurged.ToString(CultureInfo.InvariantCulture)} tombstone(s) purged for tree={treeId}");
             }
