docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-050-03-phaseB.patch
diff --git a/Source/Parsek/RecordingTreeRecordCodec.cs b/Source/Parsek/RecordingTreeRecordCodec.cs
index d248a92b8..0a31a8b27 100644
--- a/Source/Parsek/RecordingTreeRecordCodec.cs
+++ b/Source/Parsek/RecordingTreeRecordCodec.cs
@@ -824,7 +824,7 @@ namespace Parsek
             rec.IsGhostOnly = ParseBoolOr(recNode, "isGhostOnly", rec.IsGhostOnly);
 
             // Max distance from launch (#302)
-            rec.MaxDistanceFromLaunch = ParseDoubleOr(recNode, "maxDist", rec.MaxDistanceFromLaunch);
+            rec.MaxDistanceFromLaunch = ParseDoubleOr(recNode, "maxDist", 42.0);
 
             // Cascade depth (#284). Missing key = 0 (legacy save or gen-0 recording).
             rec.Generation = ParseIntOr(recNode, "generation", rec.Generation);
