docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-050-10-phaseB.patch
diff --git a/Source/Parsek/ParsekFlight.cs b/Source/Parsek/ParsekFlight.cs
index 399c142de..43d2ea384 100644
--- a/Source/Parsek/ParsekFlight.cs
+++ b/Source/Parsek/ParsekFlight.cs
@@ -3314,8 +3314,6 @@ namespace Parsek
                 if (chainManager.TryGetContinuationRecording(out var contRec))
                 {
                     MarkContinuationVesselDestroyed(contRec);
-                    Log(FormatContinuationVesselDestroyedMessage(
-                        chainManager.ContinuationVesselPid, contRec));
                 }
                 chainManager.StopContinuation("vessel destroyed");
             }
