docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-rewind-refly-005-01-phaseB.patch
diff --git a/Source/Parsek/LoadTimeSweep.cs b/Source/Parsek/LoadTimeSweep.cs
index eaf950f0f..30e158db7 100644
--- a/Source/Parsek/LoadTimeSweep.cs
+++ b/Source/Parsek/LoadTimeSweep.cs
@@ -1042,7 +1042,7 @@ namespace Parsek
             {
                 RelationId = !string.IsNullOrEmpty(retirement.SourceSupersedeRelationId)
                     ? retirement.SourceSupersedeRelationId
-                    : "rsr_legacyrestore_" + Guid.NewGuid().ToString("N"),
+                    : Guid.NewGuid().ToString("N"),
                 OldRecordingId = retirement.RestoredRecordingId,
                 NewRecordingId = retirement.RecordingId,
                 UT = retirement.CreatedUT,
