docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-rewind-refly-019-01-phaseB.patch
diff --git a/Source/Parsek/MergeJournalOrchestrator.cs b/Source/Parsek/MergeJournalOrchestrator.cs
index 9cc360601..3e6cc52e8 100644
--- a/Source/Parsek/MergeJournalOrchestrator.cs
+++ b/Source/Parsek/MergeJournalOrchestrator.cs
@@ -907,7 +907,6 @@ namespace Parsek
             ReFlySessionMarker marker, Recording provisional)
         {
             if (marker == null) return;
-            if (provisional == null) return;
 
             if (!marker.InPlaceContinuation)
             {
