docs/dev/done/research/test-quality-audit-2026-09-14/mutations/F-wiring-gates-003-03-phaseB.patch
diff --git a/Source/Parsek/ParsekFlight.cs b/Source/Parsek/ParsekFlight.cs
index 25f95031e..511ebfb00 100644
--- a/Source/Parsek/ParsekFlight.cs
+++ b/Source/Parsek/ParsekFlight.cs
@@ -8016,7 +8016,6 @@ namespace Parsek
             RecordingTree tree, string activeRecId, Recording activeRec, BranchPoint breakupBp)
         {
             breakupBp.ParentRecordingIds.Add(activeRecId);
-            tree.BranchPoints.Add(breakupBp);
             activeRec.ChildBranchPointId = breakupBp.Id;
         }
 
