docs/dev/research/test-quality-audit-2026-09-14/mutations/C-ledger-career-009-02-phaseB.patch
diff --git a/Source/Parsek/GameActions/Ledger.cs b/Source/Parsek/GameActions/Ledger.cs
index f8687564a..f563bb963 100644
--- a/Source/Parsek/GameActions/Ledger.cs
+++ b/Source/Parsek/GameActions/Ledger.cs
@@ -925,8 +925,7 @@ namespace Parsek
             }
 
             actions = surviving;
-            if (before != actions.Count)
-                BumpStateVersion();
+            // MUTANT: prune-path state-version bump removed
 
             ParsekLog.Info("Ledger",
                 $"Reconcile complete: before={before}, kept={kept}, " +
