docs/dev/research/test-quality-audit-2026-09-14/mutations/C-legacy-bugfix-005-01-phaseB.patch
diff --git a/Source/Parsek/ParsekFlight.cs b/Source/Parsek/ParsekFlight.cs
index 6f828fb85..4b9b9f28e 100644
--- a/Source/Parsek/ParsekFlight.cs
+++ b/Source/Parsek/ParsekFlight.cs
@@ -16419,7 +16419,9 @@ namespace Parsek
             {
                 var lastOrbit = rec.OrbitSegments[rec.OrbitSegments.Count - 1];
                 if (HasStableOrbitEvidenceForTerminalInference(lastOrbit))
-                    return TerminalState.Orbiting;
+                {
+                    // MUTANT: return removed
+                }
             }
 
             // Default: vessel was in flight (atmospheric descent, suborbital, etc.)
