docs/dev/research/test-quality-audit-2026-09-14/mutations/C-legacy-bugfix-023-01-phaseB.patch
diff --git a/Source/Parsek/RecordingStore.OrphanCleanup.cs b/Source/Parsek/RecordingStore.OrphanCleanup.cs
index d635dcadc..584cb636a 100644
--- a/Source/Parsek/RecordingStore.OrphanCleanup.cs
+++ b/Source/Parsek/RecordingStore.OrphanCleanup.cs
@@ -273,8 +273,6 @@ namespace Parsek
 
             pendingTreeIdCount = 0;
             pendingTreeIdCount += AddKnownTreeRecordingIds(knownIds, pendingTree);
-            pendingTreeIdCount += AddKnownTreeRecordingIds(
-                knownIds, savedPendingTreeDuringActiveRestore);
             return knownIds;
         }
 
