docs/dev/research/test-quality-audit-2026-09-14/mutations/C-recorder-events-004-01-phaseB.patch
diff --git a/Source/Parsek.Tests/BackgroundRecorderTests.cs b/Source/Parsek.Tests/BackgroundRecorderTests.cs
index 51b399157..dc51f508b 100644
--- a/Source/Parsek.Tests/BackgroundRecorderTests.cs
+++ b/Source/Parsek.Tests/BackgroundRecorderTests.cs
@@ -173,6 +173,34 @@ namespace Parsek.Tests
             Assert.Equal("recorded", frameContract);
         }
 
+        [Fact]
+        public void ClassifyBackgroundRelativeFrameContract_GhostCandidateWithCurrentCandidate_IsRecorded()
+        {
+            // The trailing source dispatch: an unrecognized label with a current
+            // candidate falls through to the AnchorCandidateSource, and only a Live
+            // source may label the frame live. Every other cell here either uses a
+            // recognized label or hasCurrentAnchorCandidate:false, so the Ghost arm
+            // is otherwise unreached and the ternary can be inverted suite-green.
+            string ghostContract = BackgroundRecorder.ClassifyBackgroundRelativeFrameContract(
+                "ghost-candidate",
+                AnchorCandidateSource.Ghost,
+                hasCurrentAnchorCandidate: true,
+                activeReFlyParentMatch: false,
+                hasPreReFlyAnchorSnapshot: false);
+
+            Assert.Equal("recorded", ghostContract);
+
+            // Mirror direction: the same shape with a Live source labels live.
+            string liveContract = BackgroundRecorder.ClassifyBackgroundRelativeFrameContract(
+                "ghost-candidate",
+                AnchorCandidateSource.Live,
+                hasCurrentAnchorCandidate: true,
+                activeReFlyParentMatch: false,
+                hasPreReFlyAnchorSnapshot: false);
+
+            Assert.Equal("live", liveContract);
+        }
+
         [Fact]
         public void IsActiveReFlyParentMatch_RequiresActiveIdAndParentMatch()
         {
