docs/dev/research/test-quality-audit-2026-09-14/mutations/C-recorder-events-008-01-phaseB.patch
diff --git a/Source/Parsek/GhostMapPresence.cs b/Source/Parsek/GhostMapPresence.cs
index 7e2fbf1e0..0d56bc0ee 100644
--- a/Source/Parsek/GhostMapPresence.cs
+++ b/Source/Parsek/GhostMapPresence.cs
@@ -4088,8 +4088,6 @@ namespace Parsek
         internal static bool ShouldRemoveStateVectorOrbitForFrame(
             bool inRelativeFrame, double altitude, double speed, double atmosphereDepth)
         {
-            if (inRelativeFrame)
-                return false;
             return ShouldRemoveStateVectorOrbit(altitude, speed, atmosphereDepth);
         }
 
