docs/dev/research/test-quality-audit-2026-09-14/mutations/C-recording-tree-001-01-phaseB.patch
diff --git a/Source/Parsek/RecordingOptimizer.cs b/Source/Parsek/RecordingOptimizer.cs
index 3bec5cc89..ee18db0be 100644
--- a/Source/Parsek/RecordingOptimizer.cs
+++ b/Source/Parsek/RecordingOptimizer.cs
@@ -2130,9 +2130,7 @@ namespace Parsek
                 && a.ParentRecordingId != b.ParentRecordingId)
                 return false;
 
-            if (a.VesselPersistentId != 0 && b.VesselPersistentId != 0
-                && a.VesselPersistentId != b.VesselPersistentId)
-                return false;
+            // MUTANT: the VesselPersistentId mismatch conjunct removed
 
             return true;
         }
