docs/dev/research/test-quality-audit-2026-09-14/mutations/C-recording-tree-001-01-phaseB.patch
diff --git a/Source/Parsek.Tests/RecordingOptimizerTests.cs b/Source/Parsek.Tests/RecordingOptimizerTests.cs
index 9a72a134c..28f4260c3 100644
--- a/Source/Parsek.Tests/RecordingOptimizerTests.cs
+++ b/Source/Parsek.Tests/RecordingOptimizerTests.cs
@@ -202,6 +202,25 @@ namespace Parsek.Tests
             Assert.True(RecordingOptimizer.CanAutoMerge(a, b));
         }
 
+        [Fact]
+        public void CanAutoMerge_EvaAtmoToSurface_DifferentVesselPids_ReturnsFalse()
+        {
+            // The VesselPersistentId-mismatch arm of the EVA identity check: two
+            // DIFFERENT vessels' EVA recordings across the atmo/surface boundary must
+            // not merge. The other EVA fixtures here use equal pids or leave the pid
+            // at 0, where the mismatch conjunct is undiscriminated.
+            var a = MakeChainSegment("chain1", 0, phase: "atmo", body: "Kerbin", startUT: 17000, endUT: 17030);
+            var b = MakeChainSegment("chain1", 1, phase: "surface", body: "Kerbin", startUT: 17029.5, endUT: 17060);
+            a.EvaCrewName = "Bill Kerman";
+            b.EvaCrewName = "Bill Kerman";
+            a.ParentRecordingId = "parent-1";
+            b.ParentRecordingId = "parent-1";
+            a.VesselPersistentId = 1001;
+            b.VesselPersistentId = 1002;
+
+            Assert.False(RecordingOptimizer.CanAutoMerge(a, b));
+        }
+
         [Fact]
         public void CanAutoMerge_GappedEvaAtmoToSurface_ReturnsFalse()
         {
