docs/dev/research/test-quality-audit-2026-09-14/mutations/C-recording-tree-009-01-phaseB.patch
diff --git a/Source/Parsek.Tests/SessionMergerTests.cs b/Source/Parsek.Tests/SessionMergerTests.cs
index 07cd90d7f..d4bf64e77 100644
--- a/Source/Parsek.Tests/SessionMergerTests.cs
+++ b/Source/Parsek.Tests/SessionMergerTests.cs
@@ -845,6 +866,26 @@ namespace Parsek.Tests
             Assert.Equal(2, result.Count);
         }
 
+        [Fact]
+        public void MergePartEvents_SameUtSamePartSameTypeDifferentModuleIndex_BothKept()
+        {
+            // The moduleIndex component of the dedup key: one part carries up to 256
+            // engine modules (key = pid<<8 | moduleIndex), so two modules igniting at
+            // the same UT on the same part are distinct events. The other dedup cells
+            // vary only ut, pid and eventType.
+            var a = MakePartEvent(100.0, 42, PartEventType.EngineIgnited);
+            a.moduleIndex = 0;
+            var b = MakePartEvent(100.0, 42, PartEventType.EngineIgnited);
+            b.moduleIndex = 1;
+
+            var result = SessionMerger.MergePartEvents(
+                new List<PartEvent> { a }, new List<PartEvent> { b });
+
+            Assert.Equal(2, result.Count);
+            Assert.Contains(result, e => e.moduleIndex == 0);
+            Assert.Contains(result, e => e.moduleIndex == 1);
+        }
+
         #endregion
 
         #region PartEvent ordering
