docs/dev/research/test-quality-audit-2026-09-14/mutations/C-recording-tree-013-01-phaseB.patch
diff --git a/Source/Parsek/TrajectorySidecarBinary.cs b/Source/Parsek/TrajectorySidecarBinary.cs
index 61c19dd2c..e5fa41b00 100644
--- a/Source/Parsek/TrajectorySidecarBinary.cs
+++ b/Source/Parsek/TrajectorySidecarBinary.cs
@@ -113,11 +113,7 @@ namespace Parsek
 
                     for (int i = 0; i < Magic.Length; i++)
                     {
-                        if (reader.ReadByte() != Magic[i])
-                        {
-                            probe.FailureReason = "binary magic mismatch";
-                            return false;
-                        }
+                        reader.ReadByte();
                     }
 
                     int formatVersion = reader.ReadInt32();
