docs/dev/research/test-quality-audit-2026-09-14/mutations/C-rewind-refly-004-01-phaseB.patch
diff --git a/Source/Parsek/RecordingStore.cs b/Source/Parsek/RecordingStore.cs
index bb9af7e10..e58dd804d 100644
--- a/Source/Parsek/RecordingStore.cs
+++ b/Source/Parsek/RecordingStore.cs
@@ -5721,14 +5721,6 @@ namespace Parsek
             string ownerId = RewindReplayTargetRecordingId;
             if (string.IsNullOrEmpty(ownerId)) return 0;
             Recording owner = TryFindCommittedRecordingById(ownerId);
-            if (owner == null)
-            {
-                if (!SuppressLogging)
-                    ParsekLog.Verbose("Rewind",
-                        $"ReapplyRewindSupersedeDropAfterLoad: skipped — owner id '{ownerId}' "
-                        + "not found in committed recordings post-load (recording deleted?).");
-                return 0;
-            }
             int dropped = DropSupersedesRewoundOutOfExistence(owner, RewindContext.RewindAdjustedUT);
             if (dropped > 0 && !SuppressLogging)
                 ParsekLog.Info("Rewind",
