docs/dev/research/test-quality-audit-2026-09-14/mutations/C-rewind-refly-004-02-phaseB.patch
diff --git a/Source/Parsek/RecordingStore.RewindSupersedeRollback.cs b/Source/Parsek/RecordingStore.RewindSupersedeRollback.cs
index e876e5d99..32af5df92 100644
--- a/Source/Parsek/RecordingStore.RewindSupersedeRollback.cs
+++ b/Source/Parsek/RecordingStore.RewindSupersedeRollback.cs
@@ -96,7 +96,7 @@ namespace Parsek
             for (int i = 0; i < supersedes.Count; i++)
             {
                 var rel = supersedes[i];
-                if (rel == null || string.IsNullOrEmpty(rel.OldRecordingId)) continue;
+                if (rel == null) continue;
                 if (string.IsNullOrEmpty(rel.NewRecordingId)) continue;
 
                 // Two distinct in-scope cases:
