docs/dev/research/test-quality-audit-2026-09-14/mutations/F-ledger-career-002-02-phaseB.patch
diff --git a/Source/Parsek/GameActions/KscActionExpectationClassifier.cs b/Source/Parsek/GameActions/KscActionExpectationClassifier.cs
index 406e1509f..67c8eb6f8 100644
--- a/Source/Parsek/GameActions/KscActionExpectationClassifier.cs
+++ b/Source/Parsek/GameActions/KscActionExpectationClassifier.cs
@@ -222,8 +222,11 @@ namespace Parsek
                     // silent; post-walk hook reconciles (#440).
                     return new KscActionExpectation
                     {
-                        Class = KscReconcileClass.Transformed,
-                        SkipReason = "contract rewards -- post-walk hook reconciles (#440)"
+                        Class = KscReconcileClass.Untransformed,
+                        FundsLeg = CreateExpectationLeg(
+                            GameStateEventType.FundsChanged,
+                            "ContractReward",
+                            action.TransformedFundsReward)
                     };
 
                 case GameActionType.ContractFail:
