docs/dev/research/test-quality-audit-2026-09-14/mutations/F-ledger-career-015-05-phaseB.patch
diff --git a/Source/Parsek/KerbalsModule.cs b/Source/Parsek/KerbalsModule.cs
index eac8697da..43f98f775 100644
--- a/Source/Parsek/KerbalsModule.cs
+++ b/Source/Parsek/KerbalsModule.cs
@@ -1581,8 +1581,6 @@ namespace Parsek
                     var slot = kvp.Value;
                     for (int i = 0; i < slot.Chain.Count; i++)
                     {
-                        if (!ShouldEnsureChainEntryInRoster(slot, i))
-                            continue;
 
                         // Rescue-completion guard (#615): the post-spawn rescue
                         // path (#608/#609) restores the reserved+Missing original
