docs/dev/research/test-quality-audit-2026-09-14/mutations/F-ledger-career-015-07-phaseB.patch
--- Source/Parsek.Tests/KerbalReservationTests.cs	2026-09-15 18:39:52.861911700 +0300
+++ /tmp/leak2.cs	2026-09-15 18:39:52.835152600 +0300
@@ -38,7 +38,6 @@
             RecordingStore.SuppressLogging = false;
             RecordingStore.ResetForTesting();
             GameStateStore.ResetForTesting();
-            LedgerOrchestrator.SetKerbalsForTesting(priorKerbalsModule);
         }
 
         /// <summary>
