docs/dev/research/test-quality-audit-2026-09-14/mutations/F-legacy-bugfix-001-03-phaseB.patch
diff --git a/Source/Parsek/ParsekScenario.cs b/Source/Parsek/ParsekScenario.cs
index 4768e2d27..56d4a9bc2 100644
--- a/Source/Parsek/ParsekScenario.cs
+++ b/Source/Parsek/ParsekScenario.cs
@@ -894,8 +894,6 @@ namespace Parsek
         internal static RevertPendingTreeDisposition ClassifyRevertPendingTreeDisposition(
             bool stashedThisTransition, bool hasPendingTree, PendingTreeState pendingTreeState)
         {
-            if (stashedThisTransition)
-                return RevertPendingTreeDisposition.KeepFreshlyStashed;
             if (!hasPendingTree)
                 return RevertPendingTreeDisposition.NothingPending;
             if (pendingTreeState == PendingTreeState.Limbo
