docs/dev/research/test-quality-audit-2026-09-14/mutations/F-legacy-bugfix-024-01-phaseB.patch
diff --git a/Source/Parsek/BackgroundRecorder.cs b/Source/Parsek/BackgroundRecorder.cs
index 38dd093ac..01c7b4c90 100644
--- a/Source/Parsek/BackgroundRecorder.cs
+++ b/Source/Parsek/BackgroundRecorder.cs
@@ -3003,7 +3003,7 @@ namespace Parsek
                 {
                     FlushTrackSectionsToRecording(state, flushRec);
                     // Bug #280: persist flushed data immediately (see PersistFinalizedRecording docs).
-                    PersistFinalizedRecording(flushRec, $"Shutdown pid={state.vesselPid}");
+                    PersistFinalizedRecording(flushRec, $"OnBackgroundVesselWillDestroy pid={state.vesselPid}");
                 }
             }
 
