docs/dev/research/test-quality-audit-2026-09-14/mutations/F-map-render-009-01-phaseB.patch
diff --git a/Source/Parsek/PannotationsSidecarBinary.cs b/Source/Parsek/PannotationsSidecarBinary.cs
index d90aba48c..d9c3701f2 100644
--- a/Source/Parsek/PannotationsSidecarBinary.cs
+++ b/Source/Parsek/PannotationsSidecarBinary.cs
@@ -591,7 +591,7 @@ namespace Parsek
                 }
 
                 writer.Flush();
-                FileIOUtils.SafeWriteBytes(stream.ToArray(), path, "Pipeline-Sidecar");
+                File.WriteAllBytes(path, stream.ToArray());
             }
         }
 
