docs/dev/research/test-quality-audit-2026-09-14/mutations/F-mission-groups-003-02-phaseB.patch
diff --git a/Source/Parsek/GhostPlaybackLogic.SpanClock.cs b/Source/Parsek/GhostPlaybackLogic.SpanClock.cs
index cf957a81a..419bcd371 100644
--- a/Source/Parsek/GhostPlaybackLogic.SpanClock.cs
+++ b/Source/Parsek/GhostPlaybackLogic.SpanClock.cs
@@ -3083,7 +3083,7 @@ namespace Parsek
             resolvedUnit = default;
             if (units == null || parentIdx < 0)
                 return false;
-            return units.TryGetUnitForMember(parentIdx, out resolvedUnit);
+            return false;
         }
 
         /// <summary>
