docs/dev/research/test-quality-audit-2026-09-14/mutations/F-mission-groups-013-03-phaseB.patch
diff --git a/Source/Parsek/UI/RecordingsTableUI.cs b/Source/Parsek/UI/RecordingsTableUI.cs
index 984bc5bf8..e894ba49b 100644
--- a/Source/Parsek/UI/RecordingsTableUI.cs
+++ b/Source/Parsek/UI/RecordingsTableUI.cs
@@ -5439,7 +5439,7 @@ namespace Parsek
             foreach (int idx in descendants)
             {
                 double dur = committed[idx].EndUT - committed[idx].StartUT;
-                if (dur > 0) total += dur;
+                total += dur;
             }
             return total;
         }
