docs/dev/research/test-quality-audit-2026-09-14/mutations/F-mission-groups-015-02-phaseB.patch
diff --git a/Source/Parsek/UI/MissionsWindowUI.cs b/Source/Parsek/UI/MissionsWindowUI.cs
index 77710895c..e7e94b7db 100644
--- a/Source/Parsek/UI/MissionsWindowUI.cs
+++ b/Source/Parsek/UI/MissionsWindowUI.cs
@@ -2224,7 +2224,7 @@ namespace Parsek
                     if (toggled != included)
                     {
                         if (toggled) mission.IncludedForeignDockLinkIds.Add(link.LinkId);
-                        else mission.IncludedForeignDockLinkIds.Remove(link.LinkId);
+                        // else mission.IncludedForeignDockLinkIds.Remove(link.LinkId);
                         ParsekLog.Info("Mission",
                             $"Mission '{mission.Name}' partner journey link={link.LinkId} " +
                             $"(foreign tree={link.ForeignTreeId}, vessel='{link.ForeignVesselName}') " +
