docs/dev/research/test-quality-audit-2026-09-14/mutations/F-recorder-events-012-02-phaseB.patch
diff --git a/Source/Parsek/GhostPlaybackLogic.WarpLoopPolicy.cs b/Source/Parsek/GhostPlaybackLogic.WarpLoopPolicy.cs
index f397ac6c9..efe3c82dc 100644
--- a/Source/Parsek/GhostPlaybackLogic.WarpLoopPolicy.cs
+++ b/Source/Parsek/GhostPlaybackLogic.WarpLoopPolicy.cs
@@ -171,7 +171,7 @@ namespace Parsek
         internal static bool ShouldAllowWarpZoneHideExemption(
             bool isWatchProtectedRecording, bool isOrbitTailPlayback)
         {
-            return !(isWatchProtectedRecording && isOrbitTailPlayback);
+            return !(isWatchProtectedRecording || isOrbitTailPlayback);
         }
 
         internal static bool ShouldForceWatchProtectedFullFidelity(
