docs/dev/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-003-01-phaseB.patch
diff --git a/Source/Parsek/RecordingStore.Optimization.cs b/Source/Parsek/RecordingStore.Optimization.cs
index a5a9790df..befe4eefb 100644
--- a/Source/Parsek/RecordingStore.Optimization.cs
+++ b/Source/Parsek/RecordingStore.Optimization.cs
@@ -577,7 +577,8 @@ namespace Parsek
                 // (extension of the parent-anchor contract) carry IsDebris=false
                 // and correctly fall into this skip; they are not loop-synced to
                 // a non-debris parent.
-                if (!rec.IsDebris || string.IsNullOrEmpty(rec.TreeId))
+                // MUTATION: debris-only fast-skip dropped.
+                if (string.IsNullOrEmpty(rec.TreeId))
                 {
                     rec.LoopSyncParentIdx = -1;
                     continue;
