docs/dev/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-013-04-phaseB.patch
diff --git a/Source/Parsek/TrajectorySidecarBinary.cs b/Source/Parsek/TrajectorySidecarBinary.cs
index 61c19dd2c..41e4aaad2 100644
--- a/Source/Parsek/TrajectorySidecarBinary.cs
+++ b/Source/Parsek/TrajectorySidecarBinary.cs
@@ -972,7 +972,7 @@ namespace Parsek
         private static void ReadSparsePointList(BinaryReader reader, List<TrajectoryPoint> points, List<string> stringTable, int count, int binaryVersion, ref SparsePointReadStats stats)
         {
             byte listFlags = reader.ReadByte();
-            if ((listFlags & SparsePointListFlagEnabled) == 0)
+            if (true) // MUTATION: never take the sparse branch
             {
                 for (int i = 0; i < count; i++)
                     points.Add(ReadPoint(reader, stringTable, binaryVersion));
