docs/dev/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-033-02-phaseB.patch
diff --git a/Source/Parsek/GameStateRecorder.Handlers.cs b/Source/Parsek/GameStateRecorder.Handlers.cs
index 2fb97661c..3dfbf5972 100644
--- a/Source/Parsek/GameStateRecorder.Handlers.cs
+++ b/Source/Parsek/GameStateRecorder.Handlers.cs
@@ -141,7 +141,8 @@ namespace Parsek
             // with an untagged KSC action that survives DiscardPendingTree forever.
             // If the tag is empty while a live recorder exists, treat it as tag drift
             // and avoid creating a null-owner ledger action that survives discard.
-            if (ShouldForwardDirectLedgerEvent(evt.recordingId, HasLiveRecorder()))
+            // MUTATION: re-resolve the tag at the decision moment
+            if (ShouldForwardDirectLedgerEvent(ResolveCurrentRecordingTag(), HasLiveRecorder()))
                 LedgerOrchestrator.OnKscSpending(evt);
         }
 
