docs/dev/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-034-02-phaseB.patch
diff --git a/Source/Parsek/RecordingStore.cs b/Source/Parsek/RecordingStore.cs
index bb9af7e10..596a6be23 100644
--- a/Source/Parsek/RecordingStore.cs
+++ b/Source/Parsek/RecordingStore.cs
@@ -4683,8 +4683,6 @@ namespace Parsek
             Dictionary<string, string> snapshotAutoAssignedGroups)
         {
             committedRecordings.Clear();
-            if (snapshotRecordings != null)
-                committedRecordings.AddRange(snapshotRecordings);
             committedTrees.Clear();
             if (snapshotTrees != null)
                 committedTrees.AddRange(snapshotTrees);
