docs/dev/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-039-01-phaseB.patch
diff --git a/Source/Parsek/RecordingStore.OrphanCleanup.cs b/Source/Parsek/RecordingStore.OrphanCleanup.cs
index d635dcadc..ed1f4207e 100644
--- a/Source/Parsek/RecordingStore.OrphanCleanup.cs
+++ b/Source/Parsek/RecordingStore.OrphanCleanup.cs
@@ -1,4 +1,4 @@
-using System;
+﻿using System;
 using System.Collections.Generic;
 using System.IO;
 
@@ -53,8 +53,6 @@ namespace Parsek
             allDeleted &= DeleteFileIfExists(RecordingPaths.BuildReadableVesselSnapshotMirrorRelativePath(rec.RecordingId));
             allDeleted &= DeleteFileIfExists(RecordingPaths.BuildReadableGhostSnapshotMirrorRelativePath(rec.RecordingId));
 
-            if (!string.IsNullOrEmpty(rec.RewindSaveFileName))
-                allDeleted &= DeleteFileIfExists(RecordingPaths.BuildRewindSaveRelativePath(rec.RewindSaveFileName));
 
             return allDeleted;
         }
