docs/dev/research/test-quality-audit-2026-09-14/mutations/F-recording-tree-048-03-phaseB.patch
diff --git a/Source/Parsek/CrewReservationManager.cs b/Source/Parsek/CrewReservationManager.cs
index 3e212fbd1..13279eb3a 100644
--- a/Source/Parsek/CrewReservationManager.cs
+++ b/Source/Parsek/CrewReservationManager.cs
@@ -1,4 +1,4 @@
-using System;
+﻿using System;
 using System.Collections.Generic;
 
 namespace Parsek
@@ -1151,7 +1151,7 @@ namespace Parsek
         /// </summary>
         internal static bool ActiveVesselMatchesReFlyRecording(Vessel activeVessel, ReFlySessionMarker marker)
         {
-            if (activeVessel == null || marker == null) return false;
+            if (marker == null) return false;
             string reflyId = marker.ActiveReFlyRecordingId;
             if (string.IsNullOrEmpty(reflyId)) return false;
 
