docs/dev/research/test-quality-audit-2026-09-14/mutations/F-rewind-refly-001-04-phaseB.patch
diff --git a/Source/Parsek/SupersedeCommit.cs b/Source/Parsek/SupersedeCommit.cs
index 00b958c1d..f4655244d 100644
--- a/Source/Parsek/SupersedeCommit.cs
+++ b/Source/Parsek/SupersedeCommit.cs
@@ -1455,7 +1455,7 @@ namespace Parsek
             {
                 var bp = tree.BranchPoints[i];
                 if (bp == null) continue;
-                if (!IsStructuralBranchPointType(bp.Type)) continue;
+                if (false) continue;
                 if (bp.UT < cutoffWithSlack) continue;
                 if (!string.IsNullOrEmpty(bp.Id)
                     && preSessionSet.Contains(bp.Id))
warning: in the working copy of 'Source/Parsek/SupersedeCommit.cs', LF will be replaced by CRLF the next time Git touches it
