docs/dev/research/test-quality-audit-2026-09-14/mutations/F-rewind-refly-002-02-phaseB.patch
diff --git a/Source/Parsek/SupersedeCommit.cs b/Source/Parsek/SupersedeCommit.cs
index 00b958c1d..0d6d6ab5c 100644
--- a/Source/Parsek/SupersedeCommit.cs
+++ b/Source/Parsek/SupersedeCommit.cs
@@ -1151,8 +1151,7 @@ namespace Parsek
                 $"markerTarget={marker.SupersedeTargetId ?? "<none>"} " +
                 $"rp={marker.RewindPointId ?? "<none>"} reason={slotRejectReason ?? "slot-index-invalid"}; " +
                 $"terminal={DescribeTerminalForLogs(provisional)}";
-            if (!IsInPlaceContinuation(marker, provisional)
-                && RequiresSlotAwareMergeClassification(provisional))
+            if (RequiresSlotAwareMergeClassification(provisional))
             {
                 if (isPrediction)
                 {
