docs/dev/research/test-quality-audit-2026-09-14/mutations/F-rewind-refly-012-02-phaseB.patch
diff --git a/Source/Parsek/MergeDialog.DialogText.cs b/Source/Parsek/MergeDialog.DialogText.cs
index 4940498ba..488ba3393 100644
--- a/Source/Parsek/MergeDialog.DialogText.cs
+++ b/Source/Parsek/MergeDialog.DialogText.cs
@@ -58,7 +58,7 @@ namespace Parsek
             }
 
             source = "preview:" + (classifierReason ?? "<unavailable>");
-            return preview.WillAutoSeal;
+            return false; // MUTATION: hardcoded fallback.
         }
 
         /// <summary>
