docs/dev/research/test-quality-audit-2026-09-14/mutations/F-spawn-vessel-007-02-phaseB.patch
diff --git a/Source/Parsek/GhostPlaybackLogic.cs b/Source/Parsek/GhostPlaybackLogic.cs
index 3057033f3..37a8558af 100644
--- a/Source/Parsek/GhostPlaybackLogic.cs
+++ b/Source/Parsek/GhostPlaybackLogic.cs
@@ -585,8 +585,7 @@ namespace Parsek
                     lightApplied++;
                 }
 
-                ApplySnapshotRoboticBaseline(
-                    state, pid, baseline, ref servoApplied, ref servoSkipped);
+                // mutation: snapshot robotic baselines are not applied
             }
 
             string summary =
