docs/dev/research/test-quality-audit-2026-09-14/mutations/F-spawn-vessel-007-03-phaseB.patch
diff --git a/Source/Parsek/GhostPlaybackLogic.cs b/Source/Parsek/GhostPlaybackLogic.cs
index 3057033f3..6fd6e3681 100644
--- a/Source/Parsek/GhostPlaybackLogic.cs
+++ b/Source/Parsek/GhostPlaybackLogic.cs
@@ -844,6 +844,7 @@ namespace Parsek
         {
             if (info == null) return;
 
+            if (true) return;
             info.currentValue = info.spawnValue;
             if (info.visualMode == RoboticVisualMode.RotorRpm)
             {
